core/app/Models/Model_data.php

SELECT *
FROM `tbl_profil`
---
    public function tampilProfil()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_profil');
        $builder->select('*');
        return $builder->get()->getResultArray();

SELECT *
FROM `tbl_sekolah`
ORDER BY `idSekolah` DESC
 LIMIT 3
---
    public function tampilOrganisasiSekolahLimit($limit)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_sekolah');
        $builder->select('*');
        $builder->orderBy('idSekolah', 'DESC');
        $builder->LIMIT($limit);
        return $builder->get()->getResultArray();

SELECT *
FROM `tbl_tenaga_pendidik`
ORDER BY `idTenagaPendidik` DESC
---
    public function cekStrukturOrganisasiPendidikById($idPendidik)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_tenaga_pendidik');
        $builder->select('*');
        $builder->where('idTenagaPendidik', $idPendidik);
        return $builder->get()->getResultArray();

SELECT *
FROM `tbl_berita`
ORDER BY `idBerita` DESC
---
    public function tampilBerita()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_berita');
        $builder->select('*');
        $builder->orderBy('idBerita', 'DESC');
        return $builder->get()->getResultArray();

SELECT *
FROM `tbl_berita`
ORDER BY `idBerita` DESC
 LIMIT 3
---
    public function tampilBeritaLimit($limit)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_berita');
        $builder->select('*');
        $builder->orderBy('idBerita', 'DESC');
        $builder->LIMIT($limit);
        return $builder->get()->getResultArray();

SELECT *
FROM `tbl_berita`
WHERE `idBerita` = '3'
---
    public function cekBeritaById($idBerita)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_berita');
        $builder->select('*');
        $builder->where('idBerita', $idBerita);
        return $builder->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `tbl_berita`
---
    public function jumlahBerita()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_berita');
        $builder->select('*');
        return $builder->countAllResults();

SELECT *
FROM `tbl_galeri`
ORDER BY `idGaleri` DESC
---
    public function tampilGaleri()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_galeri');
        $builder->select('*');
        $builder->orderBy('idGaleri', 'DESC');
        return $builder->get()->getResultArray();

SELECT *
FROM `tbl_info_sekolah`
ORDER BY `idInfoSekolah` DESC
---
    public function tampilInformasiSekolah()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_info_sekolah');
        $builder->select('*');
        $builder->orderBy('idInfoSekolah', 'DESC');
        return $builder->get()->getResultArray();

SELECT *
FROM `tbl_info_sekolah`
WHERE `idInfoSekolah` = '4'
---
    public function cekInformasiSekolahById($idGaleri)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_info_sekolah');
        $builder->select('*');
        $builder->where('idInfoSekolah', $idGaleri);
        return $builder->get()->getResultArray();

SELECT *
FROM `tbl_prestasi`
ORDER BY `idPrestasi` DESC
---
    public function tampilPrestasi()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_prestasi');
        $builder->select('*');
        $builder->orderBy('idPrestasi', 'DESC');
        return $builder->get()->getResultArray();

SELECT *
FROM `tbl_prestasi`
WHERE `idPrestasi` = '2'
---
    public function cekPrestasiById($idPrestasi)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_prestasi');
        $builder->select('*');
        $builder->where('idPrestasi', $idPrestasi);
        return $builder->get()->getResultArray();