core/app/Controllers/Galeri_.php

    public function create()
    {
        $session           = session();
        $modelInfoSekolah  = new Model_galeri();
        $modelLog          = new Model_log;
        $modelData         = new Model_data;
        $usernameAkses     = $session->get('username');
        $keterangan        = $this->request->getPost('keterangan');
        $gambar            = $this->request->getFile('gambar');
        $pathgambar        = $gambar->getRandomName();
        if (!$gambar->hasMoved()) {
            $gambar->move('uploads/galeri/', $pathgambar);
        }
        $data = [
            'keterangan'  => $keterangan,
            'author'      => $usernameAkses,
            'waktu'       => date('y-m-d  h:i:s a'),
            'gambar'      => $pathgambar,
        ];
        $modelInfoSekolah->insert($data);
        $dataLog = [
            'username'      => $usernameAkses,
            'waktu'         => date('Y-m-d H:i:s'),
            'keterangan'    => "Melakukan Penambahan galeri"
        ];
        $modelLog->insert($dataLog);
---
INSERT INTO `tbl_galeri` (`keterangan`, `author`, `waktu`, `gambar`) VALUES ('adfadfadf', 'admin', '24-11-14  07:27:47 am', '1731569267_95134b51607919b61463.jpg')
INSERT INTO `tbl_log` (`username`, `waktu`, `keterangan`) VALUES ('admin', '2024-11-14 07:27:47', 'Melakukan Penambahan galeri')