core/app/Controllers/OrganisasiPendidik_.php

    public function create()
    {
        $session                = session();
        $modelPendidik          = new Model_tenaga_pendidik();
        $modelLog               = new Model_log;
        $modelData              = new Model_data;
        $usernameAkses          = $session->get('username');
        $nama                   = $this->request->getPost('nama');
        $jabatan                = $this->request->getPost('jabatan');
        $foto                   = $this->request->getFile('foto');
        $pathFoto               = "pendidik_" . rand(0, 99999) . '.jpg';
        if (!$foto->hasMoved()) {
            $foto->move('uploads/strukturOrganisasi/', $pathFoto);
        }
        $data = [
            'jabatan'   => $jabatan,
            'nama'      => $nama,
            'foto'      => $pathFoto,
        ];
        $modelPendidik->insert($data);
        $dataLog = [
            'username'      => $usernameAkses,
            'waktu'         => date('Y-m-d H:i:s'),
            'keterangan'    => "Melakukan Penambahan Struktur Organisasi Sekolah"
        ];
        $modelLog->insert($dataLog);
---
INSERT INTO `tbl_tenaga_pendidik` (`nama`, `nik`, `jabatan`, `waktuBergabung`, `dokumen`, `foto`) VALUES ('lansldnlk', '809320', 'lksndlksn', '2025-12-31', 'dokumen_49301.pdf', 'pendidik_85865.jpg')
INSERT INTO `tbl_log` (`username`, `waktu`, `keterangan`) VALUES ('admin', '2025-01-20 03:57:20', 'Melakukan Penambahan Pendidik Sekolah')

    public function hapus($id = null, $usernameAkses = null)
    {
        $session                = session();
        $modelPendidik          = new Model_tenaga_pendidik;
        $modelLog               = new Model_log;
        $modelData              = new Model_data;
        $usernameAkses          = $session->get('username');
        $dataStukturOrganisasi  = $modelData->cekStrukturOrganisasiPendidikById($id);
        unlink('uploads/strukturOrganisasi/' . $dataStukturOrganisasi[0]['foto']);
        $modelPendidik->delete($id);
        $dataLog = [
            'username'   => $usernameAkses,
            'waktu'      => date('Y-m-d H:i:s'),
            'keterangan' => "Melakukan Penghapusan Struktur Organisasi Pendidik"
        ];
        $modelLog->insert($dataLog);
---
INSERT INTO `tbl_log` (`username`, `waktu`, `keterangan`) VALUES ('admin', '2025-01-20 03:58:07', 'Melakukan Penghapusan Struktur Organisasi Pendidik')