core/app/Controllers/Prestasi_.php

    public function create()
    {
        $session           = session();
        $modelInfoSekolah  = new Model_prestasi();
        $modelLog          = new Model_log;
        $modelData         = new Model_data;
        $usernameAkses     = $session->get('username');
        $judulPrestasi     = $this->request->getPost('judulPrestasi');
        $keterangan        = $this->request->getPost('keterangan');
        $gambar            = $this->request->getFile('gambar');
        $pathgambar        = $gambar->getRandomName();
        if (!$gambar->hasMoved()) {
            $gambar->move('uploads/prestasi/', $pathgambar);
        }
        $data = [
            'judulPrestasi'  => $judulPrestasi,
            'keterangan'     => $keterangan,
            'author'         => $usernameAkses,
            'waktu'          => date('y-m-d  h:i:s a'),
            'gambar'         => $pathgambar,
        ];
        $modelInfoSekolah->insert($data);
        $dataLog = [
            'username'      => $usernameAkses,
            'waktu'         => date('Y-m-d H:i:s'),
            'keterangan'    => "Melakukan Penambahan prestasi"
        ];
        $modelLog->insert($dataLog);
---
INSERT INTO `tbl_prestasi` (`judulPrestasi`, `keterangan`, `author`, `waktu`, `gambar`) VALUES ('asdasdas', 'dasdasdasd', 'admin', '24-11-14  07:28:20 am', '1731569300_0e411cd4e81340b365e0.jpg')
INSERT INTO `tbl_log` (`username`, `waktu`, `keterangan`) VALUES ('admin', '2024-11-14 07:28:20', 'Melakukan Penambahan prestasi')